[
  {
    "peakName": "Mt. Bierstadt",
    "tripReportData": [
      {
        "date": "2017-12-17",
        "report": "Nice boot pack, leave your snowshoes at home. Microspikes were helpful though not strictly required. Storm coming in later this week is going to change all this."
      },
      {
        "date": "2017-12-16",
        "report": "Great conditions. Road closed about a mile and a half before guanella pass. Road is in good condition. I didn't wear microspikes until about three-quarters of a mile from the summit and even then, they weren't essential (but very helpful on the decent). I carried my snowshoes all day but didn't use them. The ridge is pretty wind-swept. Had a chance to mess around a little bit on the sawtooth, had definite spots of ice; if you're going to go on it please be careful. Also, not crowded at all!"
      },
      {
        "date": "2017-12-02",
        "report": "Micro-spikes are necessary! 90% of route is covered w hardpacked snow & ice, so it is slippery. Windy & ice cold at summit."
      },
      {
        "date": "2017-11-29",
        "report": "Tried to get to the TH from the grant/jefferson side but the lower gate was closed for the season."
      },
      {
        "date": "2017-11-25",
        "report": "Hard packed snow through the willows, though most of the snow on the bridges has melted. Traction isn’t needed until making the climb out of the willows, then it is beneficial to the top; especially on the final climb to the summit. There is ankle deep snow to the saddle with some occasional knee deep post holing. Was grateful for my microspikes heading down. The people without traction were slipping and falling. Conditions are still ideal on the mountain. No flotation is needed."
      },
      {
        "date": "2017-11-25",
        "report": "The next snowstorm to hit the Front Range will certainly render this report obsolete: The road up to Guanella Pass was a little slippery towards the top. Nothing to worry about. Any vehicle can make it up. Don't think your 4-wheel, all-wheel is immune to losing control. I slid a bit on the downhill as an on-coming vehicle ascended. Being the Saturday after a holiday, the climb wasn't lonely. Myself and another gentleman were the only ones in crampons (most had microspikes or nothing at all). That said, it's far enough into the season where crampons are suitable and not awkward once you get high enough. I cramponed-up once I got to the ridge. I started the climb at 2:00 pm, so I'm glad I had something to carve into that late-day ice. A cautionary tale: Just about everyone reading this knows how to dress and prepare accordingly for winter in the mountains. This is a cautionary tale of identifying and candidly warning folks that shouldn't be at 14,000' in the winter. I had my first encounter with a climber that was dangerously ill-equipped for a 14er this time of year. When they asked me if I was going to the top, I said \"yes\". When they asked if they could go with me, stupidly, in retrospect, I said \"yes\". I encountered them in a white-out on the ridge. Fashion boots with soles and traction like house slippers (not hyperbole), cotton work gloves, water bottle frozen solid, no food, and maybe worst of all, alone. The combination of poor visibility, being in a hurry (to beat sundown), and a difficult language barrier prevented me from identifying the danger signs. They needed a little help to attain the summit. Fortunately, they were fit. On the way down, though, that lack of traction, increased winds, and snowblasting put things in perspective. Had I been in the right frame of mind, I would've told this person to descend immediately (while plenty of folks were still on the mountain)--that they were putting their life in danger. I ended up allowing them to put me at risk. The amount of water, layers, time, and physical assistance I lent them to get down the icy mountain put us both at risk. Being the last folks to descend, made it particularly precarious. I'm not confident this climber (their 1st 14er) would've made it out alone. I was more than happy to help, but I should have helped this young person by insisting they not follow me to the summit. The take home, for me at least, is to help people by being observant of their preparedness and shooting them straight. Mt. Bierstadt doesn't seem like much of a threat to many on this forum. But no mountain is safe in the winter. If you see someone unprepared, don't assume \"oh, it's Bierstadt...\" or \"they'll be fine\". And definitely discourage anyone from wearing Ugg (sp?) boots from climbing a 14er in the winter, or ever for that matter."
      },
      {
        "date": "2017-11-25",
        "report": "Perfect winter hiking conditions! Road still open, although i think it's scheduled to close this weekend. So, look up TH beta if you choose this route. Check out the pic for snow conditions. trail is visible 90% of the way, little wind blown in parts but look around and you'll see where it picks up again. Micro spikes is all you need now, no use for snow shoes in this condition. 2nd picture is the traverse to Mt. Evans if you curious."
      },
      {
        "date": "2017-11-25",
        "report": "Perfect early-winter conditions! Trail is snowpacked and easy to follow from the trailhead to the summit. Snowshoes definitely not needed, but spikes are useful esp. above 13,000. Hardpack on the summit ridge makes for an easy finish! Guanella Pass is still open all the way...last mile has a light snowpack but easily navigable. Based on the weather the next couple days, GET UP THERE PEOPLE!"
      },
      {
        "date": "2017-11-24",
        "report": "Road up from the south is almost entirely clear, minus one icy corner. Was surprised to find that even the trailhead lots were completely clear. Hike up was icy and wind blown from the warm week and high winds, but easy considering the time of year. We followed a snow face almost all the way up, and postholed only a time or two. A storm rolled in on the way down, blew over quickly, and left us in the sun again on the way out. Until the next storm, this is an easy hike! Traction is definitely needed though."
      },
      {
        "date": "2017-11-19",
        "report": "Started at 730 from the parking lot at the trailhead. There were no issues on the drive up Guenalla Pass road, a little icy, but nothing going slow can't make safe. The route was handpicked and didn't require traction until you pass the willows and make the first ridge. the snow was scoured, and frozen before the sun hit, so my partner and I went up following a couple of folks pretty close to the marked summer route. We put on traction before heading up the gain the summit ridge as there were icy spots on the trail. Some minor post holing, but nothing required flotation yet. Made it to the top with no issues. The wind was nothing to complain about! We couldn't have asked for better weather. By the time we went down (around 1045) there was snow melting, so we were able to make great time and even found a short glissade opportunity. Reports say the road will be closed on or about the 28th of November, so it'll add time, but until the next storm this route is good to go."
      },
      {
        "date": "2017-11-12",
        "report": "Road up Guanella pass clear, few spots of hard packed snow & ice - easily done in Honda Civic without winter tires. Hike was good, hard packed snow & ice on lower 2/3 of trail and final ascent. Traction helpful. Top 1/3 loose snow and undefined trail."
      },
      {
        "date": "2017-11-11",
        "report": "Mt. Bierstadt trail was decent. No need for spikes if you have great boots, but they are very helpful. Lots of having hard packed snow and a few small ice patches. Very cold and windy, but a very beautiful and rewarding hike."
      },
      {
        "date": "2017-11-11",
        "report": "Up Bierstadt via West slopes. No need for traction at this time. Road had a few small snow/ice patches, but open and passable by any car at this time. Traverse to Evans via Sawtooth. Ice Ax and traction mandatory (preferably crampons). Snow down to the low point in the ridge was variable. Hard stuff, but also a lot of sugar. Snow exists on the backside of Sawtooth. We had to climb up 50+ degree slope to reach the large slab area in the route description, its possible one might find a route to avoid this but unknown."
      },
      {
        "date": "2017-11-10",
        "report": "Did not attempt the peak, but the road to the pass is open. There are patches of snow and ice on the road, especially above the Guanella Pass Campground, but I was able to make it up in a Prius without snow tires."
      },
      {
        "date": "2017-11-05",
        "report": "I made an attempt for Grays and Torreys (see previous report) but the summer trailhead road was too treacherous. Decided to gun for Bierstadt instead, and made it up to the trailhead at midnight; however, there was some snow accumulating so I drove down the pass a bit to where it was plowed and decided to drive up to the trailhead in the morning in hopes that it would be a little safer. At about 0500 this morning, I made the drive back up and got about 3 miles short of the Guanella Pass summit before turning back due to about 3 inches of snow in the road. I would not recommend going for the summer trailhead. Bad weekend to climb the front range"
      },
      {
        "date": "2017-11-02",
        "report": "2wd drive to summer trail head no problem. Snow above the first hump out of the willows. Icy sections and post holing possible in rocky sections below ridge. I used traction but it could be done without (my partner didn't use traction). Extremely windy on and near the ridge"
      },
      {
        "date": "2017-10-29",
        "report": "Trail is snow free until about 12,200'. The majority of the trail is snow covered above 12,500', and traction was very useful after a hard freeze last night. Snow is deeper up top if you get off of the hard packed trails - post holing to a knee or thigh is possible - but I wouldn't take snowshoes. Fun conditions overall, but I definitely recommend some traction for up high."
      },
      {
        "date": "2017-10-20",
        "report": "I got to the trailhead around 630-645am. The willows were still frozen on the hike in, so no mud to deal with. The snow on the ascent started around 12,500ft or so. The snow was packed in nice along the trail. I lost the trail a couple times and postholed up to my knee a few times. I wore microspikes and had trekking poles and they helped greatly on the ascent and descent, but a lot of the people that I saw had neither, so I guess it would be a personal decision on those. On the descent, the sun was out and the snow started getting a little slick as it melted and gave way to mud. Getting off trail led to major postholing, once up to my waist. The willows were muddy by the time I got back to them on the descent, but they weren't unbearable."
      },
      {
        "date": "2017-10-17",
        "report": "Very nice hike today. A little icy above tree line, and the summit is a little more so, but overall, conditions were favorable."
      },
      {
        "date": "2017-10-16",
        "report": "Packed snow, not very deep, starting at about 12,500' and almost continuous to the summit. The trail through the willows is a little damp but clear of snow. Traction devices highly recommended."
      }
    ]
  },
  {
    "peakName": "Grays Peak",
    "tripReportData": [
      {
        "date": "2017-12-17",
        "report": "Road should be manageable for most 4WD cars to the old mining building a few miles up the road. The route is shockingly dry. No flotation needed, and traction not technically required (I used none today, despite bringing spikes) but probably helpful. Kelso poses absolutely no threat until the next major precipitation. You could skin/ski the road and find a couple sharky lines on Torreys, but that's about it. Would not recommend the latter."
      },
      {
        "date": "2017-12-14",
        "report": "Was able to drive in about 2 miles from I70 in high clearance 4WD. Parked near the old shed just below 11k, a mile from the summer trailhead. The drive was a little hairy at times, so in hindsight not sure if it was too smart driving in that far. About 2-3 inches of new snow the night before, but I was still able to stay on the trail most of the time. Very windy, so big drifts in places. I didn’t use floatation or traction, but traction would have been good in a few places above 13k. Round trip was 8 hours for both peaks. GPS said 10 miles and 4k gain."
      },
      {
        "date": "2017-12-10",
        "report": "Parked at the I-70 lot. Took about an hour to hike up to the 4wd TH. Beautiful day. Not a cloud in the sky and almost no wind. The trail to the summit of Grays is 95% well packed/traveled. A few spots of 5-8\" unpacked snow, but nothing to be concerned about. I put on spikes around 12,500' and kept them on until back at the TH. Snowshoes are not needed. Traverse to Torreys was straight forward. Be aware that some cornices have formed near the saddle, so don't stray too far in that direction should one happen to break off. Not as well of a defined boot pack on the traverse, but there should be several sets of prints now since the last storm. 5-8\" of snow in spots from saddle up to Torreys summit. Get out there and get it! Only saw 3 people all day!"
      },
      {
        "date": "2017-12-03",
        "report": "The road to the summer trailhead is totally manageable in a high clearance 4WD with chains. I made it up in a Jeep Wrangler with 35's and chains. I departed from the summer trailhead at about 0330, summitted Grays at 0645 and Torreys by 0800, and I made it back to the summer trailhead by 1030. I could have done it faster, but we had a first timer in our party. The snow was well packed and very icy, but my YakTrak Diamonds were sufficient. I brought snow shoes but never needed them because the snow was so hard from refreeze. The snow on the western face of Grays and any ridges was rather slick, so I'd recommend trekking poles or an ice axe, as mine came in handy. The entire south face of Torreys is almost snow free, so it was an easy summit from the saddle. All around great climb, hopefully the conditions persist through this little snow storm tonight."
      },
      {
        "date": "2017-12-02",
        "report": "We got to the winter trailhead around 4am and made a very short-lived and adrenaline-inducing attempt at driving up the road to the summer trailhead - not recommended unless you've got some serious chains or studs! The road was slick and even walking on it was pretty treacherous, so we put microspikes on right away. The trail was easy to follow the whole way up, well packed with snow and even bare in patches. We had microspikes but no snowshoes or poles, which was fine. The wind was pretty fierce after you got above treeline. We stayed on the main route that goes right under Kelso - there wasn't enough snow to look like there was any avalanche danger but that might change soon. We got to the top of Grays around 8:30 or 9 and decided to save Torreys for another day and head back the same way on the East slope of Grays. Encountered a few other hikers on the way down who had camped out and one who was pulling a tent on a sled."
      },
      {
        "date": "2017-12-02",
        "report": "Given the time of year, the whole route is still in pretty awesomely hikable condition and basically felt like a summer hike (with spikes and poles and a bit more chill in the air) because the whole trail was packed down, right to the top of Gray's. Snow on the saddle between Gray's and Torreys and around the rocks heading up Torreys but totally manageable. It was windy today at the top and along the saddle as I assume it always is, but not absurd. I think tomorrow will be windier and then true winter will return next week, so take my report with a grain of salt. I did not see anybody try to drive up past the winter closure, so there's definitely some extra mileage to plan for"
      },
      {
        "date": "2017-11-26",
        "report": "The trail was covered with around 6 inches of snow, but it’s packed down. Microspikes were needed on the last mile to the summit. Most people parked at the winter trailhead because the 4WD road is very slick. A couple of cars did make it about half way up the 4WD road. I left the winter trailhead at 2:30a and summited at 6:15a."
      },
      {
        "date": "2017-11-18",
        "report": "Road from Winter Trailhead to Summer Trailhead covered in 6-8 inches of snow from last Fridays storm. I was able to skin from Winter Trailhead to the switchback traverses on Grays where snow was hard/icy from recent wind events. Multiple gullies on grays and the saddle are ski-able without sharks. Cold and Windy up top..."
      },
      {
        "date": "2017-11-05",
        "report": "Road to summer trailhead is one long sheet of ice covered in snow. No one is making it up that road in any kind of road going vehicle unless you have some severely studded tires and 4x4. Trail is covered completely in snow, as well as some spots of very thick ice. Snow gets much deeper as you go up. Gets up to thigh high in places. Microspikes def necessary"
      },
      {
        "date": "2017-11-05",
        "report": "Bottom line up front: Don't go to the summer trail head, the road is not in good condition. I went up to the summer trailhead at about 1930 on 4 Nov, made it up in a high clearance 4WD vehicle with snow tires, and only used 4WD low once. I woke up at about 2200 to heavy snowfall and decided to bail out on the climb. I'm lucky that I made that decision because I barely made it down the road, slipping into the ditch on the side of the road multiple times even in 4WD low. I managed to crawl my way out after about an hour. I definitely DO NOT recommend driving up to the summer trailhead unless you have one hell of a snow machine. As for the conditions of the trail, I explored for about 30 minutes before departing and it seems to be in decent condition. However, I would recommend microspikes at the very least."
      },
      {
        "date": "2017-10-28",
        "report": "The road had a couple inches of snow on it, but it was still easily drivable to the trailhead in my buddy's tacoma. The trail is snowy, and there are some icy spots on the steps down low, but in my opinion no traction is needed. I brought my crampons with me but left them in my pack the whole time. A friend and I skied a continuous line of snow off the summit down to the grays/torreys saddle then all the way down to the base of dead dog without hitting any rocks. Sub zero wind chill at the top was to be expected, but the view never disappoints."
      },
      {
        "date": "2017-10-22",
        "report": "Sporadic snow/ice on the trail in the am (and slush/ice in the pm) below the turnoff to Kelso ridge, and continuous generally hard packed snow on the trail after that."
      },
      {
        "date": "2017-10-20",
        "report": "There was not much snow/ice before the info sign towards the end of the gulch. All snow/ice pretty soon after this point. Weather was nice; it was very windy on the top of Grays and a few places along the way. This was our first 14er. Please note that even with the weather having been warm the past week, ice is still on the trail for the majority of the hike. We did not have crampons or spikes. The ascent was not hard without these, but the descent was very difficult and slow going. I would not advise a first timer to go without spikes or crampons, as it was dangerous in several places."
      },
      {
        "date": "2017-10-10",
        "report": "Everything is blanketed by snow from I-70 up. It's only a few inches of snow down low, but from the base of Kelso and up the snow gets deeper, usually only ankle deep but occasional shin-deep drifts. It's probably a wash on whether snowshoes actually help, but consider the peak to be in full winter condition (minus avy danger) until there is a dry/warm spell."
      },
      {
        "date": "2017-10-08",
        "report": "Bring spikes, gaiters were also helpful. Solid snow from about 12,500' up and a couple of steep slippery spots. Several people without spikes were turning around. Also saw some super prepared people in shorts, tshirts, and even pajama pants. Hope they turned around. I'm sure after tonight/tomorrow conditions will probably change significantly."
      },
      {
        "date": "2017-10-06",
        "report": "Started at 6:00 am, only three cars in lot, commenced at 2. We were the first to summit Grays and Torreys. Because of deep snow, route to Grays was blazed way east, steep climb to the summit, gaiters and micro spike were a must. Summit was relatively calm but cold, added a layer at this point for the rest of the day. Climb across the saddle and up the slope of Torreys was mostly clear and relatively easy. Coming down; trail from saddle that diagonals across to the main Grays descent was very difficult, with every step a 3 foot posthole. Snow shoes would have been golden. After this recent snow they would be a must. Multiple gear options can make the summit this time of year less strenous; in other words be prepared."
      },
      {
        "date": "2017-09-30",
        "report": "6:30 am start time. Still some spots left in the lot, and not too crowded on the climb up. Some ice low but easy to avoid, and then a good bit of snow and wind as we started up Grays. Fair amount of post-holing and trudging but microspikes not needed going up. Fun slide down to the saddle from Grays summit. Less snow on Torreys but some ice, so microspikes were useful descending Torreys. Trudged and post-holed over to the junction, and then Grays Trail back down was nicely packed snow by that point -- much easier than the ascent. Sky was clear at both summits but clouds seemed to be coming in when we finished."
      },
      {
        "date": "2017-09-30",
        "report": "Good amount of snow as you ascend from the valley,3-5 inches on the trail but firm bootpack all the way up, no post holing. Microspikes recommended."
      },
      {
        "date": "2017-09-29",
        "report": "Full winter conditions above about 12.2k. Snow to several feet deep in places, but good trench/bootpack already in place. Ridge down to Torreys had some postholing, but overall fun and fast. Trail to Torreys had less snow but still a few postholing sections (much fewer people made it to Torreys today). Traverse from G/T saddle is starting to get a bit wind loaded...OK for now, but if more snow falls avy danger may become a concern. Beautiful day!"
      },
      {
        "date": "2017-09-26",
        "report": "Weather was great - warm and wind free. The trail had several inches of snow, but was easily travelled. I used microspikes, but others may not find them necessary. Most other hikers made the summit (except the one who was hiking in sandals). The road to the trailhead was no problem with a 4WD vehicle."
      }
    ]
  }
]