[
  {
    "date": "2017-12-02",
    "info": "Route: West Slopes\nPosted On: 2017-12-03, By: jayraiola\nInfo: Micro-spikes are necessary! 90% of route is covered w hardpacked snow & ice, so it is slippery. Windy & ice cold at summit. "
  },
  {
    "date": "2017-11-29",
    "info": "Route: West Slopes\nPosted On: 2017-11-30, By: beltdrive303\nInfo: Tried to get to the TH from the grant/jefferson side but the lower gate was closed for the season. "
  },
  {
    "date": "2017-11-25",
    "info": "Route: West Slopes\nPosted On: 2017-11-26, By: Kcmartinez22\nInfo: Hard packed snow through the willows, though most of the snow on the bridges has melted. Traction isn’t needed until making the climb out of the willows, then it is beneficial to the top; especially on the final climb to the summit. There is ankle deep snow to the saddle with some occasional knee deep post holing. Was grateful for my microspikes heading down. The people without traction were slipping and falling. Conditions are still ideal on the mountain. No flotation is needed. "
  },
  {
    "date": "2017-11-25",
    "info": "Route: West Slopes\nPosted On: 2017-11-26, By: beddy\nInfo: The next snowstorm to hit the Front Range will certainly render this report obsolete: The road up to Guanella Pass was a little slippery towards the top. Nothing to worry about. Any vehicle can make it up. Don't think your 4-wheel, all-wheel is immune to losing control. I slid a bit on the downhill as an on-coming vehicle ascended. Being the Saturday after a holiday, the climb wasn't lonely. Myself and another gentleman were the only ones in crampons (most had microspikes or nothing at all). That said, it's far enough into the season where crampons are suitable and not awkward once you get high enough. I cramponed-up once I got to the ridge. I started the climb at 2:00 pm, so I'm glad I had something to carve into that late-day ice. A cautionary tale: Just about everyone reading this knows how to dress and prepare accordingly for winter in the mountains. This is a cautionary tale of identifying and candidly warning folks that shouldn't be at 14,000' in the winter. I had my first encounter with a climber that was dangerously ill-equipped for a 14er this time of year. When they asked me if I was going to the top, I said \"yes\". When they asked if they could go with me, stupidly, in retrospect, I said \"yes\". I encountered them in a white-out on the ridge. Fashion boots with soles and traction like house slippers (not hyperbole), cotton work gloves, water bottle frozen solid, no food, and maybe worst of all, alone. The combination of poor visibility, being in a hurry (to beat sundown), and a difficult language barrier prevented me from identifying the danger signs. They needed a little help to attain the summit. Fortunately, they were fit. On the way down, though, that lack of traction, increased winds, and snowblasting put things in perspective. Had I been in the right frame of mind, I would've told this person to descend immediately (while plenty of folks were still on the mountain)--that they were putting their life in danger. I ended up allowing them to put me at risk. The amount of water, layers, time, and physical assistance I lent them to get down the icy mountain put us both at risk. Being the last folks to descend, made it particularly precarious. I'm not confident this climber (their 1st 14er) would've made it out alone. I was more than happy to help, but I should have helped this young person by insisting they not follow me to the summit. The take home, for me at least, is to help people by being observant of their preparedness and shooting them straight. Mt. Bierstadt doesn't seem like much of a threat to many on this forum. But no mountain is safe in the winter. If you see someone unprepared, don't assume \"oh, it's Bierstadt...\" or \"they'll be fine\". And definitely discourage anyone from wearing Ugg (sp?) boots from climbing a 14er in the winter, or ever for that matter. "
  },
  {
    "date": "2017-11-25",
    "info": "Route: West Slopes\nPosted On: 2017-11-26, By: dlmortier\nInfo: Perfect winter hiking conditions! Road still open, although i think it's scheduled to close this weekend. So, look up TH beta if you choose this route. Check out the pic for snow conditions. trail is visible 90% of the way, little wind blown in parts but look around and you'll see where it picks up again. Micro spikes is all you need now, no use for snow shoes in this condition. 2nd picture is the traverse to Mt. Evans if you curious. "
  },
  {
    "date": "2017-11-25",
    "info": "Route: West Slopes\nPosted On: 2017-11-25, By: mtnmike\nInfo: Perfect early-winter conditions! Trail is snowpacked and easy to follow from the trailhead to the summit. Snowshoes definitely not needed, but spikes are useful esp. above 13,000. Hardpack on the summit ridge makes for an easy finish! Guanella Pass is still open all the way...last mile has a light snowpack but easily navigable. Based on the weather the next couple days, GET UP THERE PEOPLE! "
  },
  {
    "date": "2017-11-24",
    "info": "Route: West Slopes\nPosted On: 2017-11-25, By: sctbke\nInfo: Road up from the south is almost entirely clear, minus one icy corner. Was surprised to find that even the trailhead lots were completely clear. Hike up was icy and wind blown from the warm week and high winds, but easy considering the time of year. We followed a snow face almost all the way up, and postholed only a time or two. A storm rolled in on the way down, blew over quickly, and left us in the sun again on the way out. Until the next storm, this is an easy hike! Traction is definitely needed though. "
  },
  {
    "date": "2017-11-19",
    "info": "Route: West Slopes\nPosted On: 2017-11-19, By: SuperB07\nInfo: Started at 730 from the parking lot at the trailhead. There were no issues on the drive up Guenalla Pass road, a little icy, but nothing going slow can't make safe. The route was handpicked and didn't require traction until you pass the willows and make the first ridge. the snow was scoured, and frozen before the sun hit, so my partner and I went up following a couple of folks pretty close to the marked summer route. We put on traction before heading up the gain the summit ridge as there were icy spots on the trail. Some minor post holing, but nothing required flotation yet. Made it to the top with no issues. The wind was nothing to complain about! We couldn't have asked for better weather. By the time we went down (around 1045) there was snow melting, so we were able to make great time and even found a short glissade opportunity. Reports say the road will be closed on or about the 28th of November, so it'll add time, but until the next storm this route is good to go. "
  },
  {
    "date": "2017-11-12",
    "info": "Route: West Slopes\nPosted On: 2017-11-13, By: Mlee1076\nInfo: Road up Guanella pass clear, few spots of hard packed snow & ice - easily done in Honda Civic without winter tires. Hike was good, hard packed snow & ice on lower 2/3 of trail and final ascent. Traction helpful. Top 1/3 loose snow and undefined trail. "
  },
  {
    "date": "2017-11-11",
    "info": "Route: West Slopes\nPosted On: 2017-11-12, By: njbrain\nInfo: Mt. Bierstadt trail was decent. No need for spikes if you have great boots, but they are very helpful. Lots of having hard packed snow and a few small ice patches. Very cold and windy, but a very beautiful and rewarding hike. "
  },
  {
    "date": "2017-11-11",
    "info": "Route: Bierstadt, Sawtooth, Evans\nPosted On: 2017-11-11, By: dwoodward13\nInfo: Up Bierstadt via West slopes. No need for traction at this time. Road had a few small snow/ice patches, but open and passable by any car at this time. Traverse to Evans via Sawtooth. Ice Ax and traction mandatory (preferably crampons). Snow down to the low point in the ridge was variable. Hard stuff, but also a lot of sugar. Snow exists on the backside of Sawtooth. We had to climb up 50+ degree slope to reach the large slab area in the route description, its possible one might find a route to avoid this but unknown. "
  },
  {
    "date": "2017-11-10",
    "info": "Route: West Slopes\nPosted On: 2017-11-10, By: clairekm\nInfo: Did not attempt the peak, but the road to the pass is open. There are patches of snow and ice on the road, especially above the Guanella Pass Campground, but I was able to make it up in a Prius without snow tires. "
  },
  {
    "date": "2017-11-05",
    "info": "Route: West Slopes\nPosted On: 2017-11-05, By: johnabowes\nInfo: I made an attempt for Grays and Torreys (see previous report) but the summer trailhead road was too treacherous. Decided to gun for Bierstadt instead, and made it up to the trailhead at midnight; however, there was some snow accumulating so I drove down the pass a bit to where it was plowed and decided to drive up to the trailhead in the morning in hopes that it would be a little safer. At about 0500 this morning, I made the drive back up and got about 3 miles short of the Guanella Pass summit before turning back due to about 3 inches of snow in the road. I would not recommend going for the summer trailhead. Bad weekend to climb the front range  "
  },
  {
    "date": "2017-11-02",
    "info": "Route: West Slopes\nPosted On: 2017-11-02, By: gonefishing05\nInfo: 2wd drive to summer trail head no problem. Snow above the first hump out of the willows. Icy sections and post holing possible in rocky sections below ridge. I used traction but it could be done without (my partner didn't use traction). Extremely windy on and near the ridge "
  },
  {
    "date": "2017-10-29",
    "info": "Route: West Slopes\nPosted On: 2017-10-29, By: TheRealRooster\nInfo: Trail is snow free until about 12,200'. The majority of the trail is snow covered above 12,500', and traction was very useful after a hard freeze last night. Snow is deeper up top if you get off of the hard packed trails - post holing to a knee or thigh is possible - but I wouldn't take snowshoes. Fun conditions overall, but I definitely recommend some traction for up high. "
  },
  {
    "date": "2017-10-20",
    "info": "Route: West Slopes\nPosted On: 2017-10-21, By: NDavidson\nInfo: I got to the trailhead around 630-645am. The willows were still frozen on the hike in, so no mud to deal with. The snow on the ascent started around 12,500ft or so. The snow was packed in nice along the trail. I lost the trail a couple times and postholed up to my knee a few times. I wore microspikes and had trekking poles and they helped greatly on the ascent and descent, but a lot of the people that I saw had neither, so I guess it would be a personal decision on those. On the descent, the sun was out and the snow started getting a little slick as it melted and gave way to mud. Getting off trail led to major postholing, once up to my waist. The willows were muddy by the time I got back to them on the descent, but they weren't unbearable. "
  },
  {
    "date": "2017-10-17",
    "info": "Route: West Slopes\nPosted On: 2017-10-18, By: rhetttravis\nInfo: Very nice hike today. A little icy above tree line, and the summit is a little more so, but overall, conditions were favorable. "
  },
  {
    "date": "2017-10-16",
    "info": "Route: West Slopes\nPosted On: 2017-10-16, By: Jim Davies\nInfo: Packed snow, not very deep, starting at about 12,500' and almost continuous to the summit. The trail through the willows is a little damp but clear of snow. Traction devices highly recommended. "
  },
  {
    "date": "2017-10-15",
    "info": "Route: West Slopes\nPosted On: 2017-10-15, By: stubert\nInfo: Muddy down low then progressively snowier. Trail is a bit challenging to follow in the mid-range. Microspikes were appreciated up high. No need for snowshoes or gaiters. I found trekking poles to be helpful as well. 1:45 summit 2:50 RT on the standard route from Guanella. "
  },
  {
    "date": "2017-10-11",
    "info": "Route: West Slopes\nPosted On: 2017-10-13, By: 60ner\nInfo: Snowfall from Monday this week had frozen pretty solid on the upper slopes. Crampons were very unsell and in particular coming down. "
  }
]